app/Http/Controllers/CitizenController.php

select * from `regions`
select * from `distributions`
---
    public function index(Request $request)
    {

        $query = Citizen::query();
        $regions = Region::all();
        $distributions = Distribution::all();