app/Http/Controllers/CitizenController.php

select * from `citizens`
---
    public function index(Request $request)
    {
        $user = Auth::user();

        if ($user->role_id ==1) {
            $filters = $request->all();
            $filters['regions'] = $user->regions->pluck('id')->toArray();

            // Fetch the citizens with the applied filters
            $citizens = Citizen::filter($filters)->get()->toArray();

        }

        $regions = Region::all();
        $distributions = Distribution::all();
        $distribution = null;
        $distributionId = $request->input('distributionId');

        $citizens = Citizen::filter($request->all());

select * from `citizens` where `citizens`.`id` = '405284126' limit 1
---
    public function getData(Request $request)
    {
        $query = Citizen::with('region')
            ->filter($request->all())
            ->forUserRegions()
            ->select(['id', 'firstname', 'secondname', 'thirdname', 'lastname', 'wife_name', 'family_members', 'region_id', 'wife_id', 'phone', 'note']);

        // Apply big region filter if provided
        if ($request->filled('big_regions')) {
            $query->whereHas('region', function($q) use ($request) {
                $q->whereIn('big_region_id', $request->big_regions);
            });