app/Http/Controllers/DistributionController.php

    public function getDistributions()
    {
        $distributions = Distribution::all();
---
select * from `distributions`