app/Http/Controllers/HomeController.php

    public function index()
    {
        $statistics = [
            'total_citizens' => Citizen::count(),
            'total_distributed_aid' => Distribution::count(),
            'total_regions' => BigRegion::count(),
            'total_distributions' => Distribution::count(),
        ];
---
select * from `citizens`
select * from `distributions`